#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "russian");
	//Series1◦ Даны десять вещественных чисел. Найти их сумму.
	//double x, sum = 0;
	//int i = 1;
	//while (i <= 10) {
	//	i = i + 1;
	//	cin >> x;
	//	sum += x;
	//}
	//cout << sum << endl;
	//Series2. Даны десять вещественных чисел. Найти их произведение.
	//double x, sum = 1;
	//int i = 1;
	//for (i <= 10; i = i + 1) {
	//	cin >> x;
	//	sum = sum * x;
	//}
	//cout << sum << endl;
	//Series3. Даны десять вещественных чисел. Найти их среднее арифметическое.
	//double x, sum = 1;
	//int i = 1;
	//while (i <= 10) {
	//	i = i + 1;
	//	cin >> x;
	//	sum = sum + x;
	//}
	//sum = sum / 10;
	//cout << sum << endl;
	//Series4. Дано целое число N и набор из N вещественных чисел. Вывести сумму и произведение чисел из данного набора.
	//int N1, i;
	//double N2, x, sum, pr;
	//cin >> N1;
	//i = 1;
	//sum = 0;
	//pr = 1;
	//for (i <= N1; i = i + 1) {
	//	cin >> x;
	//	sum = sum + x;
	//	pr = pr * x;
	//}
	//cout << "сумма = " << sum << endl;
	//cout << "произведение = " << pr << endl;
	//Series5. Дано целое число N и набор из N положительных вещественных чисел.Вывести в том же порядке целые части всех чисел из данного набора(как вещественные числа с нулевой дробной частью), а также сумму всех целых частей.
	//int N1, i;
	//double N2, x, sum;
	//sum = 0;
	//i = 1;
	//cin >> N1;
	//while (i <= N1) {
	//	i = i + 1;
	//	cout << i << endl;
	//	cin >> x;
	//	cout << x << endl;
	//	sum = sum + x;
	//}
	//cout << "сумма = " << sum << endl;
	//Series6. Дано целое число N и набор из N положительных вещественных чисел. Вывести в том же порядке дробные части всех чисел из данного набора(как вещественные числа с нулевой целой частью), а также произведение всех дробных частей.
	//int N1;
	//double N2, x, pr;
	//pr = 1;
	//cin >> N1;
	//for (int i = 1; i <= N1; i = i + 1) {
	//	cout << i << " ";
	//	cin >> x;
	//	cout << x << endl;
	//	pr = pr * x;
	//}
	//cout << "произведение = " << pr << endl;
}